Revit 2024 API
AssetPropertyTime Class
 Represents a connected property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyTime : AssetProperty
Visual Basic
Public Class AssetPropertyTime _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyTime : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyTime
See Also
AssetPropertyTime Members
Autodesk.Revit.DB.Visual Namespace